Revit 2027 API
BuiltInFailures.GeneralFailures.UnresolvableErrorInFamilyWarn Property
 An error occurred in family "[Name]" that cannot be automatically resolved.\nError Information:\n"[Text]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnresolvableErrorInFamilyWarn { get; }
Public Shared ReadOnly Property UnresolvableErrorInFamilyWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnresolvableErrorInFamilyWarn {
	FailureDefinitionId^ get ();
}
static member UnresolvableErrorInFamilyWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace